In [59]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis-kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random.choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
df.head()

   siswa_id   pelajaran  nilai jenis-kelamin kelas
0         1      Fisika     50     laki-laki   12D
1         2      Fisika     23     laki-laki   12B
2         3      Fisika     43     perempuan   12C
3         4     Biologi     88     laki-laki   12D
4         5  Matematika     87     perempuan   12D

<h2>Soal 1: Indexing</h2>

1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai

In [60]:
# code here
#kolom nilai dan kelas
df[['nilai', 'kelas']]

    nilai kelas
0      50   12D
1      23   12B
2      43   12C
3      88   12D
4      87   12D
5      28   12A
6      46   12C
7      56   12C
8      31   12A
9      48   12C
10     72   12B
11     47   12C
12     63   12A
13     31   12C
14     27   12B
15     99   12B
16     11   12D
17      9   12C
18     87   12A
19     44   12B

In [61]:
#kolom baris 5-10 dari kolom nilai dan kelas
df.loc[5:10,['nilai', 'kelas']]

    nilai kelas
5      28   12A
6      46   12C
7      56   12C
8      31   12A
9      48   12C
10     72   12B

<h2>Soal 2: Filter DataFrame Dengan Boolean</h2>

1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C

In [62]:
# code here
#siswa yang mengikuti kelas ekonomi
ekonomi = df.pelajaran == 'Ekonomi'
#siswa yang mengikuti kelas ekonomi
fisika = df.pelajaran == 'Fisika'
print(df[(ekonomi) | (fisika)])

    siswa_id pelajaran  nilai jenis-kelamin kelas
0          1    Fisika     50     laki-laki   12D
1          2    Fisika     23     laki-laki   12B
2          3    Fisika     43     perempuan   12C
6          7   Ekonomi     46     laki-laki   12C
12        13    Fisika     63     perempuan   12A
15        16    Fisika     99     perempuan   12B
16        17    Fisika     11     perempuan   12D
17        18    Fisika      9     perempuan   12C

In [63]:
#siswa dengan nilai diatas 50
nilai_lebih = df.nilai > 50
print(df[nilai_lebih])

    siswa_id   pelajaran  nilai jenis-kelamin kelas
3          4     Biologi     88     laki-laki   12D
4          5  Matematika     87     perempuan   12D
7          8     Biologi     56     laki-laki   12C
10        11       Kimia     72     laki-laki   12B
12        13      Fisika     63     perempuan   12A
15        16      Fisika     99     perempuan   12B
18        19       Kimia     87     perempuan   12A

In [64]:
# siswa dengan nilai diatas 70
nilai_bagus = df.nilai > 70
#siswa berjenis kelamin perempuan
perempuan = df['jenis-kelamin'] == 'perempuan'
#siswa dikelas 12C
kelas= df.kelas == '12C'
print(df[(nilai_bagus) & (perempuan) & (kelas)])

Empty DataFrame
Columns: [siswa_id, pelajaran, nilai, jenis-kelamin, kelas]
Index: []

In [65]:
#dataframe lengkap
print(df)

    siswa_id   pelajaran  nilai jenis-kelamin kelas
0          1      Fisika     50     laki-laki   12D
1          2      Fisika     23     laki-laki   12B
2          3      Fisika     43     perempuan   12C
3          4     Biologi     88     laki-laki   12D
4          5  Matematika     87     perempuan   12D
5          6  Matematika     28     laki-laki   12A
6          7     Ekonomi     46     laki-laki   12C
7          8     Biologi     56     laki-laki   12C
8          9  Matematika     31     perempuan   12A
9         10     Geologi     48     perempuan   12C
10        11       Kimia     72     laki-laki   12B
11        12  Matematika     47     perempuan   12C
12        13      Fisika     63     perempuan   12A
13        14     Geologi     31     laki-laki   12C
14        15       Kimia     27     perempuan   12B
15        16      Fisika     99     perempuan   12B
16        17      Fisika     11     perempuan   12D
17        18      Fisika      9     perempuan   12C
18        19       Kimia     87     perempuan   12A
19        20     Biologi     44     perempuan   12B

<h2>Soal 3: Data Transformation</h2>

lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

![alt text](https://drive.google.com/uc?id=1wed-EbRSTA0JP1ceDp6lcKBqH2yJ4aa3)

In [73]:
#menghitung normalisasi dari nilai df
def normalize(df):
  max_value = df.max()
  min_value = df.min()
  result = (df - min_value) / (max_value - min_value)
  return result
print(df[['nilai']].apply(normalize))

       nilai
0   0.455556
1   0.155556
2   0.377778
3   0.877778
4   0.866667
5   0.211111
6   0.411111
7   0.522222
8   0.244444
9   0.433333
10  0.700000
11  0.422222
12  0.600000
13  0.244444
14  0.200000
15  1.000000
16  0.022222
17  0.000000
18  0.866667
19  0.388889

In [67]:
# tanpa function
normalized_df=(df.nilai-df.nilai.min())/(df.nilai.max()-df.nilai.min())
print(normalized_df)

0     0.455556
1     0.155556
2     0.377778
3     0.877778
4     0.866667
5     0.211111
6     0.411111
7     0.522222
8     0.244444
9     0.433333
10    0.700000
11    0.422222
12    0.600000
13    0.244444
14    0.200000
15    1.000000
16    0.022222
17    0.000000
18    0.866667
19    0.388889
Name: nilai, dtype: float64

In [74]:
#series nilai dari df
print(df.nilai)

0     50
1     23
2     43
3     88
4     87
5     28
6     46
7     56
8     31
9     48
10    72
11    47
12    63
13    31
14    27
15    99
16    11
17     9
18    87
19    44
Name: nilai, dtype: int64